Revit 2024 API
ConnectorElement.CreateCableTrayConnector Method
Overload List
Name | Description
CreateCableTrayConnector(Document, Reference)
 Create a new cable tray ConnectorElement.
CreateCableTrayConnector(Document, Reference, Edge)
 Create a new cable tray ConnectorElement.
See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace